Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
The GraphicObjectAttributes class is the attributes class of the graphic object.

Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes.Line
The line attributes of the graphic object. A graphic object always consists of lines.

Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes.CoordinateSystem
TODO_DOT Is this CoordinateSystem required or not???

Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes.#ctor
Creates a new graphic object attributes instance.

Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes.#ctor(System.String)
Creates a new graphic object attributes instance using the given attribute file's filename.
AttributeFile: The filename of the attribute file.